Repository: tbelbek/tbelbek-com-blazor
Catalog: tbelbek.com/Resources/Pages/Resource.*.resx
Languages: tr_tr

# AboutTxt
source: I was born on the 23rd of November of 1989 in Kadikoy, Istanbul. My childhood was in the neighborhood where I was born. My first acquaintance with computer and technology started when I became an assistant in the computer lab of the school during elementary school years, such as inserting and removing parts and formatting. This situation, which started as a hobby at first, gradually turned into love. Now I will be happy to offer you my services.
tr_tr: Basitçe söylemek gerekirse, gerçekten sevdiğim şey hakkında tutkuluyum. Başka bir deyişle, bu sitede bir iş özgeçmişi değil, sevdiği bir hobiye tutkuyla bağlı olan bir kişinin kariyerinde nasıl ilerlediğiniz göreceksiniz. <ul> <li>C# Developer</li> <li>C++ Developer</li> <li>Takım Lideri</li> <li>Mentör</li> <li>Amatör sunucu, moderatör</li> <li>Eski Atlet</li></ul>

# Adiniz
source: Name
tr_tr: Adınız

# AdresVeTelefon
source: Address and Phone Number
tr_tr: Adres ve telefon

# Agustos
source: August
tr_tr: Ağustos

# Aralik
source: December
tr_tr: Aralık

source: Close
tr_tr: Kapat

# CvIndir
source: Download my CV
tr_tr: Cv'm için tıklayın.

# Education1
source: Since April 2015 I have been certified in the fields of HTML, CSS3 JavaScript and jQuery.
tr_tr: HTML, CSS3 JavaScript ve jQuery alanlarında Nisan 2015 tarihinden beri uzmanlık sertifikam bulunmaktadır.

# Education2
source: BilgeAdam and İŞKUR, whose brand value is known to everyone, have been selected and completed successfully among 20 thousand people in this program.
tr_tr: Marka değeri herkesçe bilinen BilgeAdam ve İŞKUR ile ortak düzenlenen bu programa 20 bin kişi arasından seçilip başarıyla tamamladım.

# Education3
source: In this period, which I can evaluate as the most wrong and right choice I have made in my life, I have given the toughest struggles I may have to experience in academic life. But at the end, I've seen you add a lot to me. I've learned a lot that cannot be bought with money, such as the ability to analyze, the challenge of difficulties.
tr_tr: Hayatımda yaptığım en yanlış ve en doğru tercih olarak değerlendirebileceğim bu dönemde hayatımda belki de akademik anlamda yaşayabileceğim en sert mücadeleri verdim. Ama sonunda bittiğinde bana oldukça çok şey kattığını gördüm. Analiz yeteneği, zorluklarla mücadele etme gibi parayla satın alınamayacak çok şey öğrendim.

# Education4
source: In this course, which I continued for almost 1 year, I also studied Photoshop and Flash.
tr_tr: Yaklaşık 1 yıla yakın sürede devam ettiğim bu kursta aynı zamanda Photoshop, Flash kullanımı üzerinde de eğitim aldım.

# EKartvizitIndir
source: E-Business Card Download
tr_tr: E-Kartvizit İndir

# FromMyPerspective
source: MY BUSINESS PERSPECTIVE
tr_tr: İŞİME BAKIŞ AÇIM

# Gonder
source: Send
tr_tr: Gönder

# Hakkimda
source: About Me
tr_tr: Hakkımda

# HataOlustu
source: An error has occurred
tr_tr: Hata oluştu

# Haziran
source: June
tr_tr: Haziran

# Iletisim
source: Contact
tr_tr: İLETİŞİM

# IletisimDetaylari
source: Contact Details
tr_tr: İletişim Detayları

# IletisimExplanation
source: Fill out the form below, we will contact you as soon as possible.
tr_tr: Aşağıdaki formu doldurun, en kısa zamanda iletişime geçelim.

# Konu
source: Subject
tr_tr: Konu

# Mart
source: March
tr_tr: Mart

# Mesaj
source: Message
tr_tr: Mesaj

# MesajGonderildi
source: Your message has been sent, thanks!
tr_tr: Mesajınız gönderildi, teşekkürler!

# Modal1
source: At Borusan Otomotiv, I have developed the web portal application used in the management of additional service systems called garanti extended warranty ”. Dapper ORM tool has been used on this application and performance oriented improvement has been made. Application was developed as an MVC application.
tr_tr: Borusan Otomotiv firmasında, “uzatılmış garanti” adı verilen ek hizmet sistemlerinin yönetiminde kullanılan web portal uygulamasını geliştirmiş bulunmaktayım. Bu uygulama üzerinde Dapper ORM toolu kullanılmış olup, performans odaklı bir geliştirme yapılmıştır. Bahsi geçen uygulama, yine bir MVC uygulaması olarak geliştirilmiştir.

# Modal10
source: I actively develop the services that manage the infrastructure of the premium management system and dealer simulation system used in dealers.
tr_tr: Bayilerde kullanılan prim yönetim sistemi ve bayi simülasyon sisteminin altyapısını yöneten hizmetlerin aktif olarak geliştirmesini yapmaktayım.

# Modal2
source: At Boyner, I took part in the development of the uygulam gift card ”MVC application, which they wanted to be developed on the management modules they are currently using. This application was using oracle as the database and I had the opportunity to develop the application on the oracle database using Code-First.
tr_tr: Boyner Büyük Mağazacılık firmasında, hali hazırda kullanmakta oldukları yönetim modüllerinin üzerine geliştirilmesini istedikleri “hediye kartı” MVC uygulamasının geliştirilmesinde baştan sona görev aldım. Bu uygulama veritabanı olarak oracle kullanmakta idi ve Code-First kullanarak oracle veritabanı üzerinde uygulama geliştirme fırsatı buldum.

# Modal3
source: I have developed a stock management application for Kordsa Global. This application uses angularJS as the interface and processes very large database data in the background and is responsible for loading and displaying them in the user interface in a very short time. When I took over the application, there were serious problems with the customer and there were serious problems with the working performance. I have tried to maximize application and customer satisfaction by using both my social and technical skills and I believe that I am successful.
tr_tr: Kordsa Global firması için bir stok yönetim uygulaması geliştirmiş bulunmaktayım. Bu uygulama, arayüz olarak angularJS kullanmakta olup, arka planda çok büyük veritabanı verilerini işlemekte ve bunları çok kısa sürede kullanıcı arayüzünde yükleyip göstermekle görevli bulunmaktadır. Uygulamayı devir aldığımda müşteri ile ciddi sorunlar yaşanmış ve çalışma performansı ile ilgili olarak ciddi problemler bulunmakta idi. Gerek sosyal yeteneklerimi gerekse de teknik becerilerimi kullanarak uygulamayı ve müşteri memnuniyetini üst düzeylere çıkarmaya çalıştım ve başarılı olduğuma inanıyorum.

# Modal4
source: For MedicalPark Health Group, I worked as a technical consultant in the project of developing a new version of the currently used patient information management system application which they consider very problematic. I worked with the team working in the company I worked for, and tried to offer my clients as efficient as possible in developing the new version of this application both in the form of winform and on the web, in the solution of performance bottlenecks and in sharing the workload. During the project, I have given consultancy for about 6 months. In this project, I also had the opportunity to use ElasticSearch and Dapper technologies.
tr_tr: MedicalPark Sağlık Grubu için, hali hazırda kullanılan ve çok sorunlu şekilde addettikleri hasta bilgileri yönetim sistemi uygulamasının yeni versiyonunu geliştirme projesinde teknik danışman olarak görev yaptım. Görev aldığım firmada çalışan ekiple ortak bir çalışma gerçekleştirerek bu uygulamanın yeni versiyonunu hem winform, hem de web üzerinde çalışan versiyonlarının geliştirilmesinde hem performans darboğazlarının çözümünde hem de iş yükünü paylaşma konusunda müşterimiz olan firmaya mümkün olduğu kadar verimli bir şekilde hizmetlerimi sunmaya çalıştım. Proje süresince 6 aya yakın bir danışmanlık vermiş bulunmaktayım. Bu projede, ElasticSearch ve Dapper teknolojilerini de kullanma fırsatı buldum.

# Modal5
source: MODYO A.Ş. I have taken part in the development of sign digital signage ”in-vehicle advertising / media display application which has been developed for the company and will be started to be tested soon. This application consists of two parts, while two of my friends developed the android side, I developed the Web Portal side by myself and made ready for publication. This application has been developed by using microservice architecture as structure and C # as language and uses MVC and Web API technologies. I have also actively used mq structures in the previous paragraph and in all of the applications mentioned in this paragraph.
tr_tr: MODYO A.Ş. firması için de geliştirilen ve yakın zamanda testlerine başlanacak olan “digital signage” yani araç içi reklam/medya gösterimi uygulamasının geliştirilmesinde, baştan sona görev almış bulunmaktayım. Bu uygulama, iki parçadan oluşuyor olup, iki arkadaşım android tarafını geliştirirken ben de tek başıma Web Portal tarafını geliştirmiş ve yayına hazır hale getirmiş bulunmaktayım. Bu uygulama, yapı olarak yine mikroservis mimarisini ve dil olarak da C# kullanılarak geliştirilmiş olup, MVC ve Web API teknolojilerini kullanmaktadır. Aynı zamanda önceki paragrafta ve bu paragrafta bahsedilen uygulamaların hepsinde mq yapılarını aktif olarak kullanmış bulunmaktayım.

# Modal6
source: This project, which is being developed for IETT and will manage the public transportation systems in Istanbul, is being developed by MVC on the basis of microservice architecture, MVC application and Web based, and I took part in the development processes of user management system and fleet management system applications. MVC applications communicate with on-board computers and server software to instantly save the necessary information such as road, task, pricing to the database and related storage systems and these data can be monitored live from the same applications at the same time. The project is approximately 18 months old and will be completed in June 2018. The user management application is an MVC application developed on the oracle database with code first, while the Fleet management system is another MVC application that is currently being actively developed using only webservers.
tr_tr: İETT firması için geliştirilmekte olan ve İstanbul üzerindeki toplu taşıma sistemlerini yönetecek olan bu proje, MVC tarafında mikroservis mimarisi ile MVC uygulaması ve Web tabanlı olarak geliştirilmekte olup, ben kullanıcı yönetim sistemi ve filo yönetim sistemi uygulamaları geliştirme süreçlerinde görev aldım/almaktayım. MVC uygulamaları araç bilgisayarları ile server yazılımları üzerinden haberleşerek gerekli yol, görev, ücretlendirme gibi bilgileri anlık olarak veritabanı ve ilgili depolama sistemlerine kaydetmekte ve aynı uygulamalardan bu veriler aynı zamanda canlı olarak izlenebilmektedir. Proje, yaklaşık 18 aylık bir proje olup Haziran 2018 ayında canlıya alınacaktır. Kullanıcı yönetimi uygulaması, code first ile oracle veritabanı üzerinde geliştirilmiş bir MVC uygulaması, Filo yönetim sistemi ise veritabanı çok az bir şekilde kullanılarak sadece webservisler kullanılarak halen aktif olarak geliştirilmekte olan başka bir MVC uygulamasıdır.

# Modal8
source: I actively provide corporate project development and support services in a portfolio ranging from the software in the product lines used in Arçelik factories to the in and out of the Arçelik campuses.
tr_tr: Arçelik fabrikalarında kullanılan ürün bantlarındaki yazılımdan başlayıp arçelik kampüslerindeki giriş çıkışlara kadar değişen bir portföyde kurumsal proje geliştirme ve destek hizmetini aktif olarak sunmaktayım.

# Modal9
source: Bosch makes trucks and warehouse entry and exit of firms in the turkey warehouse management, customer satisfaction and innovation projects that have won awards maintenance, I provide additional development and support services.
tr_tr: Bosch firmasının türkiye depolarındaki tır ve depo giriş çıkış yönetimlerini yapan, müşteri memnuniyeti ve inovasyon ödülleri kazanmış olan projenin bakım, ek geliştirme ve destek hizmetini sunmaktayım.

# Nisan
source: April
tr_tr: Nisan

# Quote1
source: Confucius
tr_tr: Konfüçyus

# SentTweets
source: tweet sent bt @redstreetwalker
tr_tr: @@redstreetwalker tarafından gönderilen tweetler

# Skills
source: MY SKILLS
tr_tr: YETENEKLERİM

# SkillsExplanation
source: Below is my expertise on technologies and programs.
tr_tr: Teknolojiler ve programlar hakkındaki uzmanlık düzeylerimi aşağıda görebilirsiniz.

# Testimonial1
source: Choose a job that you like so you don't have to work for a day in your life.
tr_tr: Sevdiğiniz bir işi seçin, böylelikle hayatınızda bir gün bile olsun çalışmak zorunda kalmamış olursunuz.

# Testimonial2
source: I picked the job I love.
tr_tr: Ben en sevdiğim işi seçtim.

source: Consulted Companies
tr_tr: Danışmanlık verdiğim şirketler

source: EDUCATION
tr_tr: EĞİTİM

# EducationTag1
source: C#, MVC, HTML, CSS, JS and MS SQL Standards
tr_tr: C#, MVC, HTML, CSS, JS ve MS SQL Standartları

# EducationTag2
source: Physics
tr_tr: Lisans - Fizik Bölümü

# EducationTag3
source: HTML, CSS, JS Standards
tr_tr: HTML, CSS, JS Standartları

# Now
source: Current
tr_tr: Günümüz

source: WORK
tr_tr: İŞ

source: Software Specialist
tr_tr: Yazılım Uzmanı

# Modal11
source: All the after-sale services administration portal of the Ford retailers all around Turkey
tr_tr: Türkiye genelindeki tüm Ford bayilerinin ve müşterilerinin satış sonrası işlemlerini yaptığı "Servis Yönetim Sistemi" portalı

# EducationTag4
source: Management of IT Systems
tr_tr: Yüksek Lisans - Bilişim Sistemleri Yönetimi

# SchoolLife
source: School
tr_tr: Okul

# PersonalWebpageTitle
source: T. Belbek Personal Web Page
tr_tr: T. Belbek Kişisel Web Sayfası

# Fikirler
source: About My Job
tr_tr: Fikirler

# Gecmisim
source: Resume
tr_tr: Geçmİşİm

# Giris
source: Home
tr_tr: Giriş

# HakkimdaNav
source: About
tr_tr: Hakkımda

# Intro1
source: I'm a <span>software designer</span>, <span>illustrator</span> and <span>web designer</span> from Istanbul/Turkey. Let's <a class="smoothscroll" href="#about" style="color:forestgreen;">start scrolling</a> and learn more <a class="smoothscroll" href="#about" style="color:darkorange;">about me</a>,
tr_tr: Ben Tuğhan Belbek, sizlere <span> yazılım geliştirme </span> veya <span>fizikçi</span> olarak hizmet vermekten mutluluk duyacağım. Hakkımdaki detaylı bilgiler sayfanın <a class="smoothscroll" href="#about" style="color:forestgreen;"> aşağısında </a>bulunmaktadır.

# Projelerim
source: Works
tr_tr: Projelerim

# DownloadCv
source: or you can download my CV from here.
tr_tr: Ya da CV'mi hızlıca buradan indirebilirsiniz.

source: Hide Menu
tr_tr: Menüyü Gizle

source: Show Menu
tr_tr: Menüyü Göster

# Merhaba
source: I'm Tughan Belbek.
tr_tr: Merhaba.

# Temmuz
source: July
tr_tr: Temmuz
